Install Pandas from console:
```
> pip install pandas
```

In [1]:
import numpy as np
import pandas as pd

# Pandas Series

In [2]:
array = np.ones(5)
s = pd.Series(data=array, index=['row_1', 'row_2', 'row_3', 'row_4', 'row_5'])
s

row_1    1.0
row_2    1.0
row_3    1.0
row_4    1.0
row_5    1.0
dtype: float64

# Pandas Dataframe

In [3]:
data = {
    'Country': ['Belgium', 'India', 'Brazil'],
    'Capital': ['Brussels', 'New Delhi', 'Brasília'],
    'Population': [11190846, 1303171035, 207847528]
}

df = pd.DataFrame(data=data)
display(df.head(2))
display(df.tail(2))
display(df.shape)
display(df.columns)

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035

  Country    Capital  Population
1   India  New Delhi  1303171035
2  Brazil   Brasília   207847528

(3, 3)

Index(['Country', 'Capital', 'Population'], dtype='object')

# Indexing

In [4]:
display(df['Capital'])
display(df.loc[[0, 2] , ['Capital','Population']])
display(df.iloc[:, 1:])

0     Brussels
1    New Delhi
2     Brasília
Name: Capital, dtype: object

    Capital  Population
0  Brussels    11190846
2  Brasília   207847528

     Capital  Population
0   Brussels    11190846
1  New Delhi  1303171035
2   Brasília   207847528

In [5]:
# Boolean index
df[df['Population']>1200000000]

  Country    Capital  Population
1   India  New Delhi  1303171035

In [6]:
df.loc[df['Population']>1200000000, ['Country', 'Population']]

  Country  Population
1   India  1303171035

In [7]:
df.loc[1:3, 'Country'] = ['India_mod', 'Brazil_mod']
df

      Country    Capital  Population
0     Belgium   Brussels    11190846
1   India_mod  New Delhi  1303171035
2  Brazil_mod   Brasília   207847528

# Read data from CSV

In [8]:
advertising = pd.read_csv('data/Advertising.csv', index_col=0)
advertising.head()

      TV  radio  newspaper  sales
1  230.1   37.8       69.2   22.1
2   44.5   39.3       45.1   10.4
3   17.2   45.9       69.3    9.3
4  151.5   41.3       58.5   18.5
5  180.8   10.8       58.4   12.9

In [9]:
college = pd.read_csv('data/College.csv')
college.rename(columns={'Unnamed: 0': 'College'}, inplace=True)
college.head()

,College,Private,Apps,Accept,Enroll,Top10perc,Top25perc,F.Undergrad,P.Undergrad,Outstate,Room.Board,Books,Personal,PhD,Terminal,S.F.Ratio,perc.alumni,Expend,Grad.Rate
0,Abilene Christian University,Yes,1660,1232,721,23,52,2885,537,7440,3300,450,2200,70,78,18.1,12,7041,60
1,Adelphi University,Yes,2186,1924,512,16,29,2683,1227,12280,6450,750,1500,29,30,12.2,16,10527,56
2,Adrian College,Yes,1428,1097,336,22,50,1036,99,11250,3750,400,1165,53,66,12.9,30,8735,54
3,Agnes Scott College,Yes,417,349,137,60,89,510,63,12960,5450,450,875,92,97,7.7,37,19016,59
4,Alaska Pacific University,Yes,193,146,55,16,44,249,869,7560,4120,800,1500,76,72,11.9,2,10922,15